In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [ ]:
## Series -- specialized pandas data structure
# create
# access data
# add data
# delete data
# change the dtype of your data

In [3]:
# create a list with elements from 0 to 10 using the range and list functions

l1 = list(range(11))
print(l1)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [ ]:
# either use a loop, or list comprehension or map:lambda to add 1 to each element of this list

In [4]:
l1 + 1

TypeError: can only concatenate list (not "int") to list

In [5]:
l2 = []
for l in l1:
    l2.append(l+1)
print(l2)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [6]:
[x+1 for x in l1]

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [7]:
result = map(lambda x: x+1, l1)

In [9]:
list(result)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [ ]:
# moving on to Series

In [10]:
S = Series([1,2,3,4,5])

In [11]:
S

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
S[2]

3

In [14]:
S.values

array([1, 2, 3, 4, 5], dtype=int64)

In [15]:
S.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
S = Series([6,7,8,9,10], index = ['a','b','c','d','e'])

In [20]:
S

a     6
b     7
c     8
d     9
e    10
dtype: int64

In [22]:
S['b']

7

In [23]:
S[1]

7

In [24]:
S['f'] = 11

In [25]:
S

a     6
b     7
c     8
d     9
e    10
f    11
dtype: int64

In [26]:
s = Series([12,13,14,15,16], index = ['g','h','i','j','k'])

In [27]:
S = S.append(s)
S

a     6
b     7
c     8
d     9
e    10
f    11
g    12
h    13
i    14
j    15
k    16
dtype: int64

In [28]:
S.drop('g')

a     6
b     7
c     8
d     9
e    10
f    11
h    13
i    14
j    15
k    16
dtype: int64

In [31]:
S.drop(['i','j'], inplace=True)

In [32]:
S

a     6
b     7
c     8
d     9
e    10
f    11
g    12
h    13
k    16
dtype: int64

In [33]:
d = {'a':5, 'b':10}

In [34]:
S1 = Series(d)
S1

a     5
b    10
dtype: int64

In [35]:
S1['a'] = 100

In [37]:
S1

a    100
b     10
dtype: int64

In [38]:
S

a     6
b     7
c     8
d     9
e    10
f    11
g    12
h    13
k    16
dtype: int64

In [39]:
S+1

a     7
b     8
c     9
d    10
e    11
f    12
g    13
h    14
k    17
dtype: int64

In [40]:
S*5

a    30
b    35
c    40
d    45
e    50
f    55
g    60
h    65
k    80
dtype: int64

In [41]:
S**3

a     216
b     343
c     512
d     729
e    1000
f    1331
g    1728
h    2197
k    4096
dtype: int64

In [42]:
np.log(S)

a    1.791759
b    1.945910
c    2.079442
d    2.197225
e    2.302585
f    2.397895
g    2.484907
h    2.564949
k    2.772589
dtype: float64

In [43]:
S+S1

a    106.0
b     17.0
c      NaN
d      NaN
e      NaN
f      NaN
g      NaN
h      NaN
k      NaN
dtype: float64

In [44]:
S = Series([1,2,3,4,5])

In [45]:
S.dtype

dtype('int64')

In [46]:
SC = S.astype('float64')

In [47]:
SC.dtype

dtype('float64')

In [48]:
S = Series(['1',2,3,np.nan,np.nan])

In [49]:
S.dtype

dtype('O')

In [50]:
SC = S.astype('int64')

ValueError: cannot convert float NaN to integer

In [51]:
SC = S.astype('float64')

In [52]:
SC

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
dtype: float64

In [53]:
s = Series([12,13,14,15,16,17,18], index = ['g','h','i','j','k'])

ValueError: Length of passed values is 7, index implies 5.

In [ ]:
# moving on to Dataframe

In [56]:
d = {'Price':[5, 10, 13, 26, 43], 'Sales':[10,30,50,45,42]} #from a dictionary of lists

In [57]:
df = DataFrame(d)

In [58]:
df

   Price  Sales
0      5     10
1     10     30
2     13     50
3     26     45
4     43     42

In [59]:
d1 = {'Price':{'r1':20, 'r2':56}, 'Sales':{'r1':500, 'r2':600}} # #from a dictionary of dictionaries
df1 = DataFrame(d1)
print(df1)

    Price  Sales
r1     20    500
r2     56    600

In [ ]:
# from a dictionary of Series

In [92]:
d = {'Price':Series([5, 10, 13, 26, 43]), 'Sales':Series([10,30,50,45,42])}
df = DataFrame(d)
print(df)

   Price  Sales
0      5     10
1     10     30
2     13     50
3     26     45
4     43     42

In [61]:
# from multiple dictionaries (provided they have the same key:value pair) within a list

l1 = [{'Price':20,'Sales':500,'Qty':25},{'Price':30,'Sales':600,'Qty':20}]
df1 = DataFrame(l1)
df1

   Price  Sales  Qty
0     20    500   25
1     30    600   20

In [ ]:
# accessing rows and columns

In [62]:
df

   Price  Sales
0      5     10
1     10     30
2     13     50
3     26     45
4     43     42

In [63]:
df['Sales']

0    10
1    30
2    50
3    45
4    42
Name: Sales, dtype: int64

In [64]:
type(df['Sales'])

pandas.core.series.Series

In [66]:
type(df[['Sales']])

pandas.core.frame.DataFrame

In [73]:
df

   Base_Price  Unit_Sales
0           5          10
1          10          30
2          13          50
3          26          45
4          43          42

In [77]:
df.rename(columns={'Price':'Base_Price','Sales':'Unit_Sales'}, inplace=True)

In [78]:
df.columns

Index(['Base_Price', 'Unit_Sales'], dtype='object')

In [79]:
df.columns = ['Price','Sales']
df

   Price  Sales
0      5     10
1     10     30
2     13     50
3     26     45
4     43     42

In [ ]:
#methods

In [80]:
df.columns

Index(['Price', 'Sales'], dtype='object')

In [85]:
df.head()

   Price  Sales
0      5     10
1     10     30
2     13     50
3     26     45
4     43     42

In [86]:
df.describe()

           Price      Sales
count   5.000000   5.000000
mean   19.400000  35.400000
std    15.306861  15.993749
min     5.000000  10.000000
25%    10.000000  30.000000
50%    13.000000  42.000000
75%    26.000000  45.000000
max    43.000000  50.000000

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Price   5 non-null      int64
 1   Sales   5 non-null      int64
dtypes: int64(2)
memory usage: 208.0 bytes

In [88]:
df.dtypes

Price    int64
Sales    int64
dtype: object

In [89]:
df['Price'].values

array([ 5, 10, 13, 26, 43], dtype=int64)

In [90]:
df['Price'] = Series(df['Price'].values.astype(float))

In [98]:
df.dtypes

Price    float64
Sales      int64
dtype: object

In [95]:
df['Price'] = df['Price'].astype('float64')

In [97]:
df['Price'] = df['Price'].astype(np.float)

In [ ]:
#loc(label based) and iloc(integer index based)

In [99]:
df

   Price  Sales
0    5.0     10
1   10.0     30
2   13.0     50
3   26.0     45
4   43.0     42

In [102]:
df.loc[[3,0]]['Price']

3    26.0
0     5.0
Name: Price, dtype: float64

In [120]:
type(df.iloc[4]['Price'])

numpy.float64

In [117]:
type(df.iloc[[4]]['Price'])

pandas.core.series.Series

In [121]:
df.iloc[4]

Price    43.0
Sales    42.0
Name: 4, dtype: float64

In [122]:
type(df.iloc[4])

pandas.core.series.Series

In [123]:
df.iloc[4]['Price']

43.0

In [124]:
type(df.iloc[4]['Price'])

numpy.float64

In [131]:
df.iloc[[3,4]]

   Price  Sales
3   26.0     45
4   43.0     42

In [133]:
df1 = DataFrame({'Price':[5, 10, 13, 26, 43], 'Sales':[10,30,50,45,42]},index=list('abcde'))

In [134]:
df1

   Price  Sales
a      5     10
b     10     30
c     13     50
d     26     45
e     43     42

In [135]:
df1.loc['a']

Price     5
Sales    10
Name: a, dtype: int64

In [137]:
df1.iloc[0]

Price     5
Sales    10
Name: a, dtype: int64

In [139]:
df1.loc[['a','c']]

   Price  Sales
a      5     10
c     13     50

In [140]:
df1.iloc[[0,2]]

   Price  Sales
a      5     10
c     13     50

In [141]:
df1.loc[['a','c'],'Price']

a     5
c    13
Name: Price, dtype: int64

In [144]:
df1.iloc[[0,2],0]

a     5
c    13
Name: Price, dtype: int64

In [147]:
df1.iloc[[0,2],df.columns.get_loc('Price')]

a     5
c    13
Name: Price, dtype: int64

In [150]:
df1.iloc[[0,2],df.columns.get_indexer(['Price','Sales'])]

   Price  Sales
a      5     10
c     13     50

In [151]:
df1.iloc[:,1]

a    10
b    30
c    50
d    45
e    42
Name: Sales, dtype: int64

In [155]:
df1.loc[:,'Sales']

a    10
b    30
c    50
d    45
e    42
Name: Sales, dtype: int64

In [156]:
df1.loc[:,['Sales']]

   Sales
a     10
b     30
c     50
d     45
e     42

In [157]:
df1.iloc[:,[1]]

   Sales
a     10
b     30
c     50
d     45
e     42

In [158]:
store = ['SwiggyInstamart','RelianceFresh','LocalKirana','BigBasket']

In [159]:
sales = [1000,500,250,400]

In [160]:
footfall = [100,50,40,75]

In [161]:
labels = ['Store','Sales','Traffic per Hour']

In [162]:
cols = [store, sales, footfall]

In [163]:
zipped_list = list(zip(labels,cols))

In [164]:
zipped_list

[('Store', ['SwiggyInstamart', 'RelianceFresh', 'LocalKirana', 'BigBasket']),
 ('Sales', [1000, 500, 250, 400]),
 ('Traffic per Hour', [100, 50, 40, 75])]

In [165]:
dictionary = dict(zipped_list)

In [166]:
dictionary

{'Store': ['SwiggyInstamart', 'RelianceFresh', 'LocalKirana', 'BigBasket'],
 'Sales': [1000, 500, 250, 400],
 'Traffic per Hour': [100, 50, 40, 75]}

In [167]:
final_df = DataFrame(dictionary)

In [168]:
final_df

             Store  Sales  Traffic per Hour
0  SwiggyInstamart   1000               100
1    RelianceFresh    500                50
2      LocalKirana    250                40
3        BigBasket    400                75

In [ ]:
# import files

In [172]:
dat = pd.read_csv(r'C:\Users\Swastik\Desktop\Dono Consulting\Deloitte_Training\programming-in-python\sample2.csv',sep=',',header=0)

In [173]:
dat.head()

   Age Customer  Income Location
0   30        A  1200.0       A1
1   32        B  1333.0       A2
2   33      NaN     NaN      NaN

In [178]:
dat2 = pd.read_table('sample1.txt',sep='\t')

In [179]:
dat2.head()

   Age Customer   Income Location
0   30        A     1200       A1
1   32        B     1333       A2
2   33      NaN  Missing      NaN

In [180]:
dat2 = pd.read_table('sample1.txt',sep='\t',na_values=['Missing'])

In [181]:
dat2.head()

   Age Customer  Income Location
0   30        A  1200.0       A1
1   32        B  1333.0       A2
2   33      NaN     NaN      NaN

In [182]:
dat2.dtypes

Age           int64
Customer     object
Income      float64
Location     object
dtype: object

In [183]:
type(dat2)

pandas.core.frame.DataFrame